new_library/app/controllers/libraries_controller.rb

SELECT "book_users".* FROM "book_users" WHERE "book_users"."book_id" IN (?, ?, ?, ?, ?, ?, ?)  [["book_id", 1], ["book_id", 5], ["book_id", 6], ["book_id", 2], ["book_id", 4], ["book_id", 7], ["book_id", 3]]
SELECT "users".* FROM "users" INNER JOIN "book_users" ON "users"."id" = "book_users"."user_id" WHERE "book_users"."book_id" = ?  [["book_id", 1]]
SELECT "libraries".* FROM "libraries" INNER JOIN "books" ON "books"."library_id" = "libraries"."id" ORDER BY "libraries"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @libraries = Library.all.includes(books: :users)